<int>  <id, 0> <(> <int>  <id, 1> <int>  <id, 2> <)> 
<{> 
<int>  <id, 3> <=> <id, 1> <+> <id, 2> <;> 
<return>  <id, 3> <;> 
<}> 
<int>  <id, 4> <(> <)>
<{> 
<int>  <id, 5> <id, 6> <;> 
<int>  <id, 7> <[> <num, 20> <]> <;>
<int>  <id, 8> <[> <num, 10> <]> <;>
<id, 9> <(> <Literal> <)><;>
<for> <(> <int>  <id, 10> <=> <num, 0> <;><id, 10> <<> <;><id, 10> <++> <)>
<{> 
<id, 11> <(> <Literal> <,><&><id, 7> <[> <]> <)><;>
<}> 
<while> <(> <id, 10> <!> <=> <num, 10> <)>
 <id, 10> <+=> <num, 2> <;>
<switch> <(> <id, 10> <)> 
<{> 
<case>  <num, 10> <:> <id, 9> <(> <Literal> <,><id, 12> <)> <;>
<break> <;> 
<}> 
<}> 
ÿ